//დავალება , გადაიმეორეთ Object და flex, აგრეთვე ივარჯიშეთ ფუნქციებზე Number(), String() 
//და საბოლოოდ ივარჯიშეთ ლოგიკურ ოპერატორებზე II , && იმ ფაილს 
//სადაც ამ ყველაფერს დაწერთ ამიტვირთავთ github ზე და პირადში ჩამიგდებთ ლინკს


//შევქმნათ ობიექტი
// person = { name : ჯეკო,   (არგუმენტი)
//            age : 14,  
//            height : 1.45 }    
// console.log(person(age))   


// 0 = false
// 1 = true.....

// ფუნქცია Number() 
// გარდაქმნის ობიექტს რიცხვად

// ფუნქცია String() 
// ცვლადს გარდაქმნის სტრინგად

// II , &&
// and - && -- or - ||
// || მაგალითი
// false || true -- (false or true)

// &&
// num = a;
// nam2 = b;
//
// console.log( a < 1 && b < 4)

// hehehe